In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
import seaborn as sns
%matplotlib inline

In [2]:
matplotlib.rcParams['axes.unicode_minus'] = False 
matplotlib.rcParams['font.family'] = "AppleGothic"

## 결측데이터 처리

In [3]:
data_file = 'pd_sample/missing_data_test.csv'

In [13]:
df = pd.read_csv(data_file,encoding = 'cp949', index_col = '연도')

In [14]:
#df = pd.read_csv(data_file,encoding = 'cp949')

In [15]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [17]:
df.isnull().sum()

제품1    1
제품2    0
제품3    1
제품4    3
dtype: int64

In [18]:
df.drop(index = [2019]) # drop ()을 이용해 결측치가 있는 행이나 열을 없애기 가능

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [19]:
df.drop(columns = ['제품3','제품4']) # 재할당하지 않으면 원래 데이터프레임에 적용 x

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230
2019    NaN  250

In [20]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [22]:
df.drop(index = [2019], columns = ['제품3','제품4'])

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230

In [24]:
df.dropna(axis = 0) # dropna(axis = 0) 결측치가 있는 행 전체 제거

        제품1  제품2    제품3    제품4
연도
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [25]:
df.dropna(axis = 1) #dropna(axis = 1) 결측치가 있는 열 전체 제거

      제품2
연도
2015  150
2016  160
2017  200
2018  230
2019  250

In [26]:
df.dropna(axis = 1, subset = [2015]) # index가 2015인 행에서 결측치가 있는 열을 제거

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230
2019    NaN  250

In [30]:
df.dropna(axis = 1, subset = [2015,2019]) # index가 2015,2019인 행들에서 결측치가 있는 열을 제거

      제품2
연도
2015  150
2016  160
2017  200
2018  230
2019  250

* 때에 따라서는 결측치를 제거하기 보다는 특정한 값으로 채워야함 df.fillna()

In [31]:
df.fillna(0)

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    0.0    0.0
2016  200.0  160  170.0    0.0
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    0.0  250  140.0    0.0

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 2015 to 2019
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   제품1     4 non-null      float64
 1   제품2     5 non-null      int64
 2   제품3     4 non-null      float64
 3   제품4     2 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 360.0 bytes

### 데이터 요약 및 재구성

In [33]:
data_file = 'pd_sample/total_sales_data.csv'

In [34]:
df_sales = pd.read_csv(data_file)

In [36]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   매장명     9 non-null      object
 1   제품종류    9 non-null      object
 2   모델명     9 non-null      object
 3   판매      9 non-null      int64
 4   재고      9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 488.0+ bytes

In [38]:
df_sales['매장명'].value_counts()

C    3
A    3
B    3
Name: 매장명, dtype: int64

In [39]:
df_sales['제품종류'].value_counts()

스마트폰    5
TV      4
Name: 제품종류, dtype: int64

In [42]:
df_sales['모델명'].value_counts()

V1    3
S2    3
S1    2
V2    1
Name: 모델명, dtype: int64

### 피벗테이블

In [44]:
df_sales.pivot_table(index = ['매장명','제품종류','모델명'],values = ['판매','재고'],aggfunc='sum')

              재고  판매
매장명 제품종류 모델명
A   TV   V1    5   3
    스마트폰 S1    2   1
         S2    5   2
B   TV   V1    9   6
    스마트폰 S1    8   5
         S2    6   4
C   TV   V1    6   3
         V2    9   7
    스마트폰 S2    4   2

In [45]:
# aggfunc을 지정하지 않으면 기본적으로 mean

In [46]:
df_sales.pivot_table(index = ['매장명','제품종류','모델명'],values = ['판매','재고'],aggfunc='count')

              재고  판매
매장명 제품종류 모델명
A   TV   V1    1   1
    스마트폰 S1    1   1
         S2    1   1
B   TV   V1    1   1
    스마트폰 S1    1   1
         S2    1   1
C   TV   V1    1   1
         V2    1   1
    스마트폰 S2    1   1

### wordcloud이용